In [1]:
import pandas as pd
import numpy as np
import os

df_path = os.path.join(os.getcwd(), '..', 'data', 'ds_salaries.csv')

df = pd.read_csv(df_path, index_col=0)

df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

# Data Preprocessing

In [2]:
from cleaning.preprocessor import Preprocessor
pp = Preprocessor()
pp_df = pp.fit_preprocess(df)
pp_df

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,Country Name_x,Country Name_y
0,2020,MI,FT,Data Scientist,79833,DE,On-Site,DE,L,Germany,Germany
1,2020,SE,FT,Machine Learning Scientist,260000,JP,On-Site,JP,S,Japan,Japan
2,2020,SE,FT,Big Data Engineer,109024,GB,Hybrid,GB,M,United Kingdom of Great Britain and Northern I...,United Kingdom of Great Britain and Northern I...
3,2020,MI,FT,Product Data Analyst,20000,HN,On-Site,HN,S,Honduras,Honduras
4,2020,SE,FT,Machine Learning Engineer,150000,US,Hybrid,US,L,United States of America (the),United States of America (the)
...,...,...,...,...,...,...,...,...,...,...,...
602,2022,SE,FT,Data Engineer,154000,US,Remote,US,M,United States of America (the),United States of America (the)
603,2022,SE,FT,Data Engineer,126000,US,Remote,US,M,United States of America (the),United States of America (the)
604,2022,SE,FT,Data Analyst,129000,US,On-Site,US,M,United States of America (the),United States of America (the)
605,2022,SE,FT,Data Analyst,150000,US,Remote,US,M,United States of America (the),United States of America (the)
606,2022,MI,FT,AI Scientist,200000,IN,Remote,US,L,United States of America (the),India

# Data Analysis

## Markov Analysis

In [3]:
analysis_df = pp_df.copy()
analysis_df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,Country Name_x,Country Name_y
0,2020,MI,FT,Data Scientist,79833,DE,On-Site,DE,L,Germany,Germany
1,2020,SE,FT,Machine Learning Scientist,260000,JP,On-Site,JP,S,Japan,Japan
2,2020,SE,FT,Big Data Engineer,109024,GB,Hybrid,GB,M,United Kingdom of Great Britain and Northern I...,United Kingdom of Great Britain and Northern I...
3,2020,MI,FT,Product Data Analyst,20000,HN,On-Site,HN,S,Honduras,Honduras
4,2020,SE,FT,Machine Learning Engineer,150000,US,Hybrid,US,L,United States of America (the),United States of America (the)

In [4]:
from analysis.markov import MarkovProcessorFactory
from analysis.markov import MarkovObject

mo = MarkovObject()
mo.fit(analysis_df)

mpf = MarkovProcessorFactory(mo)
mpf.create_grapher().graph("US")

Fitted Object Properly

NameError: name 'ccountry' is not defined